---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs
source: html/8c35892c-e524-e0ed-c5f0-0bdafda091d2.htm
---
# DocumentSavingAsEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.